<script>
export default {
  name: "BlockBusiness",
  components: {},
  data() {
    return {
      cards: [
        {
          qst: "Что такое Bitcoin?",
          ans: `<p>
          <b>Bitcoin (BTC)</b> — это первый и наиболее известный криптовалютный актив, основанный на технологии blockchain. Он был представлен в виде открытого исходного кода в 2008 году, а его разработка была завершена в январе 2009 года. Основателем Bitcoin является неизвестный программист под псевдонимом Satoshi Nakamoto.`,
          open: false,
        },
        {
          qst: "Что такое майнинг и почему это выгодно?",
          ans: `<p>
          <b>Майнинг</b> — это процесс обработки и подтверждения транзакций в
          сети криптовалют, при котором новые блоки добавляются к блокчейну.
          Майнеры используют мощные специализированные компьютеры для решения
          сложных математических задач, и тот, кто первым решит задачу, получает
          вознаграждение в виде новых биткоинов. Это механизм, который
          одновременно выпускает новые биткоины и поддерживает работу сети
          благодаря верификации и записи транзакций. Почему майнинг может
          считаться лучшей инвестицией в Bitcoin? Больше Bitcoin на вложенные
          деньги: Главная причина, по которой майнинг является лучшей
          инвестицией в Bitcoin очень простая - за тот же объем инвестиций
          майнер в перспективе получает большее количество Bitcoin, чем при
          покупке на бирже. Оборудование растет в цене вместе с Bitcoin: Цены на
          оборудование для майнинга зависят от его доходности, а доходность - от
          цены Bitcoin. Таким образом с ростом цены на заработанный Bitcoin
          растет и стоимость оборудования, майнинг как бы удваивает вашу ставку
          на рост цены Bitcoin. Пассивный доход: После первоначальных инвестиций
          в оборудование майнеры могут регулярно получать биткоины в качестве
          вознаграждения. Поддержка инфраструктуры: Майнеры способствуют
          безопасности сети Bitcoin, что в свою очередь может повысить доверие к
          этой криптовалюте.
        </p>`,
          open: false,
        },
        {
          qst: "Почему важно начать майнинг Bitcoin сейчас?",
          ans: `<p>
          <b>Майнинг</b> — это процесс обработки и подтверждения транзакций в
          сети криптовалют, при котором новые блоки добавляются к блокчейну.
          Майнеры используют мощные специализированные компьютеры для решения
          сложных математических задач, и тот, кто первым решит задачу, получает
          вознаграждение в виде новых биткоинов. Это механизм, который
          одновременно выпускает новые биткоины и поддерживает работу сети
          благодаря верификации и записи транзакций. Почему майнинг может
          считаться лучшей инвестицией в Bitcoin? Больше Bitcoin на вложенные
          деньги: Главная причина, по которой майнинг является лучшей
          инвестицией в Bitcoin очень простая - за тот же объем инвестиций
          майнер в перспективе получает большее количество Bitcoin, чем при
          покупке на бирже. Оборудование растет в цене вместе с Bitcoin: Цены на
          оборудование для майнинга зависят от его доходности, а доходность - от
          цены Bitcoin. Таким образом с ростом цены на заработанный Bitcoin
          растет и стоимость оборудования, майнинг как бы удваивает вашу ставку
          на рост цены Bitcoin. Пассивный доход: После первоначальных инвестиций
          в оборудование майнеры могут регулярно получать биткоины в качестве
          вознаграждения. Поддержка инфраструктуры: Майнеры способствуют
          безопасности сети Bitcoin, что в свою очередь может повысить доверие к
          этой криптовалюте.
        </p>`,
          open: false,
        },
        {
          qst: "Что такое Mininig Pool?",
          ans: `<p>
          <b>Майнинг</b> — это процесс обработки и подтверждения транзакций в
          сети криптовалют, при котором новые блоки добавляются к блокчейну.
          Майнеры используют мощные специализированные компьютеры для решения
          сложных математических задач, и тот, кто первым решит задачу, получает
          вознаграждение в виде новых биткоинов. Это механизм, который
          одновременно выпускает новые биткоины и поддерживает работу сети
          благодаря верификации и записи транзакций. Почему майнинг может
          считаться лучшей инвестицией в Bitcoin? Больше Bitcoin на вложенные
          деньги: Главная причина, по которой майнинг является лучшей
          инвестицией в Bitcoin очень простая - за тот же объем инвестиций
          майнер в перспективе получает большее количество Bitcoin, чем при
          покупке на бирже. Оборудование растет в цене вместе с Bitcoin: Цены на
          оборудование для майнинга зависят от его доходности, а доходность - от
          цены Bitcoin. Таким образом с ростом цены на заработанный Bitcoin
          растет и стоимость оборудования, майнинг как бы удваивает вашу ставку
          на рост цены Bitcoin. Пассивный доход: После первоначальных инвестиций
          в оборудование майнеры могут регулярно получать биткоины в качестве
          вознаграждения. Поддержка инфраструктуры: Майнеры способствуют
          безопасности сети Bitcoin, что в свою очередь может повысить доверие к
          этой криптовалюте.
        </p>`,
          open: false,
        },
      ],
    };
  },
};
</script>
<template>
  <div class="wrapper">
    <h2>FAQ</h2>
    <div class="cards">
      <div
        class="card"
        v-for="card in cards"
        :key="card"
        @click="card.open = !card.open"
        :class="{ active: card.open }"
      >
        <div class="info">
          <span class="qst">{{ card.qst }}</span>
          <img
            v-if="!card.open"
            class="arr"
            src="../assets/arrow-down.png"
            alt=""
          />
          <img
            v-if="card.open"
            class="arr rot"
            src="../assets/arrow-down.png"
            alt=""
          />
        </div>
        <div v-if="card.open" class="ans" v-html="card.ans"></div>
      </div>
    </div>
  </div>
</template>
<style scoped>
.wrapper {
  margin-top: 40px;
  padding: 0 40px;
  display: flex;
  flex-direction: column;
  gap: 20px;
}

.cards {
  display: flex;
  flex-direction: column;
  gap: 20px;
}

.card {
  cursor: pointer;
  width: 100%;
  padding: 30px;
  border-radius: 20px;
  display: flex;
  flex-direction: column;
  gap: 20px;
}

.card:hover {
  transform: scale(1.02);
}

.info {
  display: flex;
  align-items: center;
  justify-content: space-between;
  flex-direction: row;
}

.arr {
  width: 24px;
  height: 24px;
}

.rot {
  transform: rotate(180deg);
}

@keyframes fade-in {
  from {
    opacity: 0;
  }
  to {
    opacity: 1;
  }
}

.ans {
  animation-name: fade-in;
  animation-duration: 0.5s; /* Задержка анимации */
  animation-fill-mode: forwards; /* Элемент останется в состоянии после окончания анимации */
}

.qst {
  font-weight: 600;
  font-size: 24px;
  line-height: 24px;
  color: #0f0f0f;
}

.active {
  transform: scale(1.02);

  transition: all 500ms ease;
}
</style>
